# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azuread_application.kv_sp: Reading...
data.azuread_application.kv_sp: Read complete after 0s [id=/applications/c28691c7-9899-4e43-8292-86b99b0ed3d8]
data.azuread_service_principal.aks_sp: Reading...
data.azuread_service_principal.aks_sp: Read complete after 1s [id=/servicePrincipals/624533ce-2ca8-47a9-886d-6e667defc442]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04MGJmZjNlNi0xNmM0LTQ4MzktOWNlOC02MGMxYTgzMWNlNTI7b2JqZWN0SWQ9YjU5YWI3YjktZGIzOC00YmQzLTg2MTQtZTZkMTBhZDcwYjExO3N1YnNjcmlwdGlvbklkPTdiNmY4ZjE1LTNhM2UtNDNhMi1iNmFjLThlYjZjMDZhZDEwMzt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_cdn_frontdoor_custom_domain.authz_domain must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "authz_domain" {
      ~ cdn_frontdoor_profile_id = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test" -> (known after apply) # forces replacement
      ~ expiration_date          = "2025-08-19T10:36:12.5613385+00:00" -> (known after apply)
      ~ id                       = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test/customDomains/authzdigitaltdodsbotest" -> (known after apply)
      ~ name                     = "authzdigitaltdodsbotest" -> "authzdigitaltdodsbo2test" # forces replacement
      ~ validation_token         = "_xv773qcjh6fj3w6b3kwisayxgk6k6eu" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test/secrets/0--6fd36b57-94f7-4368-9fb5-28cbe0de0692-digitaltdodsbo-tt02-altinn-no" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_cdn_frontdoor_endpoint.endpoint will be destroyed
  # (because azurerm_cdn_frontdoor_endpoint.endpoint is not in configuration)
  - resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      - cdn_frontdoor_profile_id = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test" -> null
      - enabled                  = true -> null
      - host_name                = "digdir-dd-test-authz-dgczfrbqf7f5buav.a01.azurefd.net" -> null
      - id                       = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test/afdEndpoints/digdir-dd-test-authz" -> null
      - name                     = "digdir-dd-test-authz" -> null
      - tags                     = {} -> null
    }

  # azurerm_cdn_frontdoor_endpoint.endpoint2 will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "endpoint2" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "digdir-dd-test-authz2"
    }

  # azurerm_cdn_frontdoor_origin.app_origin will be destroyed
  # (because azurerm_cdn_frontdoor_origin.app_origin is not in configuration)
  - resource "azurerm_cdn_frontdoor_origin" "app_origin" {
      - cdn_frontdoor_origin_group_id  = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test/originGroups/oed-origin-group-test" -> null
      - certificate_name_check_enabled = true -> null
      - enabled                        = true -> null
      - host_name                      = "oed-test-authz-app.azurewebsites.net" -> null
      - http_port                      = 80 -> null
      - https_port                     = 443 -> null
      - id                             = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test/originGroups/oed-origin-group-test/origins/oed-appservice-origin-test" -> null
      - name                           = "oed-appservice-origin-test" -> null
      - origin_host_header             = "oed-test-authz-app.azurewebsites.net" -> null
      - priority                       = 1 -> null
      - weight                         = 500 -> null
    }

  # azurerm_cdn_frontdoor_origin.app_origin2 will be created
  + resource "azurerm_cdn_frontdoor_origin" "app_origin2" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + host_name                      = "oed-test-authz-app.azurewebsites.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "oed-appservice-origin2-test"
      + origin_host_header             = "oed-test-authz-app.azurewebsites.net"
      + priority                       = 1
      + weight                         = 500
    }

  # azurerm_cdn_frontdoor_origin_group.origin_group will be destroyed
  # (because azurerm_cdn_frontdoor_origin_group.origin_group is not in configuration)
  - resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      - cdn_frontdoor_profile_id                                  = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test" -> null
      - id                                                        = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test/originGroups/oed-origin-group-test" -> null
      - name                                                      = "oed-origin-group-test" -> null
      - restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10 -> null
      - session_affinity_enabled                                  = true -> null

      - load_balancing {
          - additional_latency_in_milliseconds = 50 -> null
          - sample_size                        = 4 -> null
          - successful_samples_required        = 3 -> null
        }
    }

  # azurerm_cdn_frontdoor_origin_group.origin_group2 will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group2" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "oed-origin-group2-test"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # azurerm_cdn_frontdoor_profile.fd_profile will be destroyed
  # (because azurerm_cdn_frontdoor_profile.fd_profile is not in configuration)
  - resource "azurerm_cdn_frontdoor_profile" "fd_profile" {
      - id                       = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test" -> null
      - name                     = "oed-fd-profile-test" -> null
      - resource_group_name      = "altinn-digdir-oed-tt02-rg" -> null
      - resource_guid            = "aaf7d5d4-a78e-44a7-8f75-7a27f41758de" -> null
      - response_timeout_seconds = 120 -> null
      - sku_name                 = "Premium_AzureFrontDoor" -> null
      - tags                     = {} -> null
    }

  # azurerm_cdn_frontdoor_profile.fd_profile2 will be created
  + resource "azurerm_cdn_frontdoor_profile" "fd_profile2" {
      + id                       = (known after apply)
      + name                     = "oed-fd-profile-test"
      + resource_group_name      = "altinn-digdir-oed-tt02-rg"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Standard_AzureFrontDoor"
    }

  # azurerm_cdn_frontdoor_route.route must be replaced
-/+ resource "azurerm_cdn_frontdoor_route" "route" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test/customDomains/authzdigitaltdodsbotest",
        ] -> (known after apply)
      ~ cdn_frontdoor_endpoint_id       = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test/afdEndpoints/digdir-dd-test-authz" -> (known after apply) # forces replacement
      ~ cdn_frontdoor_origin_group_id   = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test/originGroups/oed-origin-group-test" -> (known after apply)
      ~ cdn_frontdoor_origin_ids        = [
          - "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test/originGroups/oed-origin-group-test/origins/oed-appservice-origin-test",
        ] -> (known after apply)
      - cdn_frontdoor_rule_set_ids      = [] -> null
      ~ id                              = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test/afdEndpoints/digdir-dd-test-authz/routes/default-route-test" -> (known after apply)
      ~ name                            = "default-route-test" -> "default-route2-test" # forces replacement
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.admin_app_client_secret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "admin_app_client_secret" {
      ~ expiration_date         = "2027-06-18T14:16:25Z" -> "2027-06-18T14:16:25.3694326Z"
        id                      = "https://oed-kv.vault.azure.net/secrets/dd-admin-app-client-secret/fea13654767041a1af90e5033b057e77"
        name                    = "dd-admin-app-client-secret"
      ~ not_before_date         = "2025-06-18T14:16:25Z" -> "2025-06-18T14:16:25.3694326Z"
        tags                    = {}
        # (8 unchanged attributes hidden)
    }

  # azurerm_monitor_diagnostic_setting.fd_logs will be destroyed
  # (because azurerm_monitor_diagnostic_setting.fd_logs is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "fd_logs" {
      - id                             = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test|frontdoor-logs" -> null
      - log_analytics_workspace_id     = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.OperationalInsights/workspaces/Workspace-altinnapps-digdir-oed-tt02-rg-WEU" -> null
      - name                           = "frontdoor-logs" -> null
      - target_resource_id             = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Cdn/profiles/oed-fd-profile-test" -> null
        # (3 unchanged attributes hidden)

      - enabled_log {
          - category = "FrontdoorAccessLog" -> null
        }

      - enabled_metric {
          - category = "AllMetrics" -> null
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # azurerm_monitor_diagnostic_setting.fd_logs2 will be created
  + resource "azurerm_monitor_diagnostic_setting" "fd_logs2" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.OperationalInsights/workspaces/Workspace-altinnapps-digdir-oed-tt02-rg-WEU"
      + name                           = "frontdoor-logs2"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "FrontdoorAccessLog"
            # (1 unchanged attribute hidden)
        }

      + enabled_metric {
          + category = "AllMetrics"
        }

      + metric (known after apply)
    }

Plan: 7 to add, 1 to change, 7 to destroy.

Changes to Outputs:
  ~ frontdoor_cname_target             = "digdir-dd-test-authz-dgczfrbqf7f5buav.a01.azurefd.net" -> (known after apply)
  ~ frontdoor_dns_validation_txt_value = "_xv773qcjh6fj3w6b3kwisayxgk6k6eu" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `pull_request` |
| Working Directory | `./infra/altinn-digdir-oed-tt02-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/test/altinn-digdir-oed-tt02-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_test_altinn-digdir-oed-tt02-rg.tfstate.tfplan` |